index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Algebraic Data Types</title>
<meta name="author" content="(Tim McIver)"/>
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js@3.8.0/css/reveal.css"/>

<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js@3.8.0/css/theme/moon.css" id="theme"/>


<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide"><h1 class="title">Algebraic Data Types</h1><h2 class="author">Tim McIver</h2><p class="date">Created: 2019-08-13 Tue 11:27</p>
</section>
<section id="table-of-contents">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#/slide-orgc834f34">What's a Type?</a></li>
<li><a href="#/slide-org08291e1">Sum Types</a></li>
<li><a href="#/slide-org6155b2e">Product Type</a></li>
<li><a href="#/slide-orga06895a">More About Unions</a></li>
</ul>
</div>
</div>
</section>

<section>
<section id="slide-sec-">
<h2 id="orgc834f34">What's a Type?</h2>
<div class="outline-text-2" id="text-orgc834f34">
</div>
</section>
<section id="slide-sec-">
<h3 id="org3d6aa04">A type can be thought of as a set of values</h3>
<ul>
<li class="fragment appear">An <code>int</code> can hold only the integers</li>
<li class="fragment appear">A <code>boolean</code> can hold only the values <code>true</code> and <code>false</code></li>
<li class="fragment appear">A value of type <code>RGBColor</code> may only be able to hold the values <code>Red</code>, <code>Green</code> and <code>Blue</code></li>
<li class="fragment appear">A value of type <code>SomeClass</code> can hold instances of <code>SomeClass</code> or its sub-classes</li>

</ul>

</section>
</section>
<section>
<section id="slide-sec-">
<h2 id="org08291e1">Sum Types</h2>
<div class="outline-text-2" id="text-org08291e1">
</div>
</section>
<section id="slide-sec-">
<h3 id="org8e02403">Also Known As</h3>
<ul>
<li class="fragment appear">tagged union</li>
<li class="fragment appear">variant</li>
<li class="fragment appear">"one of" type</li>

</ul>

</section>
<section id="slide-sec-">
<h3 id="org68efd8f">Sum Types</h3>
<p>
Used to create a new type from two or more existing types.
</p>
<p class="fragment (appear)">
For example, you could create a type that could hold an integer <i>or</i> a string.
</p>

</section>
<section id="slide-sec-">
<h3 id="org537cf81">Haskell's Canonical Union</h3>
<p>
In Haskell, the <code>Either</code> data type is used for this purpose:
</p>
<div class="org-src-container">

<pre  class="src src-haskell"><code trim><span style="color: #b4fa70;">data</span> <span style="color: #8cc4ff;">Either</span> a b <span style="color: #fcaf3e;">=</span> <span style="color: #8cc4ff;">Left</span> a <span style="color: #fcaf3e;">|</span> <span style="color: #8cc4ff;">Right</span> b
<span style="color: #b4fa70;">type</span> <span style="color: #8cc4ff;">IntOrString</span> <span style="color: #fcaf3e;">=</span> <span style="color: #8cc4ff;">Either</span> <span style="color: #8cc4ff;">Int</span> <span style="color: #8cc4ff;">String</span>

<span style="color: #fce94f;">someData</span> <span style="color: #fcaf3e;">::</span> <span style="color: #8cc4ff;">IntOrString</span>
<span style="color: #fce94f;">someData</span> <span style="color: #fcaf3e;">=</span> <span style="color: #8cc4ff;">Left</span> 42 <span style="color: #73d216;">-- </span><span style="color: #73d216;">or Right "Hello!"</span>
</code></pre>
</div>

<div class="org-src-container">

<pre  class="src src-haskell"><code trim><span style="color: #fce94f;">someFunction</span> <span style="color: #fcaf3e;">::</span> <span style="color: #8cc4ff;">IntOrString</span> <span style="color: #fcaf3e;">-&gt;</span> <span style="color: #8cc4ff;">String</span>
<span style="color: #fce94f;">someFunction</span> (<span style="color: #8cc4ff;">Left</span> i) <span style="color: #fcaf3e;">=</span> show i
<span style="color: #fce94f;">someFunction</span> (<span style="color: #8cc4ff;">Right</span> s) <span style="color: #fcaf3e;">=</span> s
</code></pre>
</div>

</section>
<section id="slide-sec-">
<h3 id="org1371a81">In Scala</h3>
<div class="org-src-container">

<pre  class="src src-scala"><code trim><span style="color: #e090d7;">sealed</span> <span style="color: #b4fa70;">trait</span> <span style="color: #8cc4ff;">Either</span>[<span style="color: #e9b2e3;">A</span>, <span style="color: #e9b2e3;">B</span>]
<span style="color: #b4fa70;">case</span> <span style="color: #b4fa70;">class</span> <span style="color: #8cc4ff;">Left</span>[<span style="color: #e9b2e3;">A</span>, <span style="color: #e9b2e3;">B</span>](a<span style="color: #b4fa70;">:</span> <span style="color: #8cc4ff;">A</span>) <span style="color: #b4fa70;">extends</span> <span style="color: #8cc4ff;">Either</span>[<span style="color: #e9b2e3;">A</span>, <span style="color: #e9b2e3;">B</span>]
<span style="color: #b4fa70;">case</span> <span style="color: #b4fa70;">class</span> <span style="color: #8cc4ff;">Right</span>[<span style="color: #e9b2e3;">A</span>, <span style="color: #e9b2e3;">B</span>](b<span style="color: #b4fa70;">:</span> <span style="color: #8cc4ff;">B</span>) <span style="color: #b4fa70;">extends</span> <span style="color: #8cc4ff;">Either</span>[<span style="color: #e9b2e3;">A</span>, <span style="color: #e9b2e3;">B</span>]

<span style="color: #b4fa70;">type</span> <span style="color: #e9b2e3;">IntOrString</span> <span style="color: #b4fa70;">=</span> <span style="color: #e9b2e3;">Either</span>[<span style="color: #e9b2e3;">Int</span>, <span style="color: #e9b2e3;">String</span>]
<span style="color: #b4fa70;">val</span> <span style="color: #fcaf3e;">someData</span><span style="color: #b4fa70;">:</span> <span style="color: #8cc4ff;">IntOrString</span> <span style="color: #b4fa70;">=</span> <span style="color: #e9b2e3;">Left</span>(<span style="color: #e9b2e3;">42</span>) <span style="color: #73d216;">// </span><span style="color: #73d216;">or Right("Hello!")</span>
</code></pre>
</div>

</section>
<section id="slide-sec-">
<h3 id="org6104fb2">What About Three Types?</h3>
<p>
In Haskell:
</p>
<div class="org-src-container">

<pre  class="src src-haskell"><code trim><span style="color: #b4fa70;">type</span> <span style="color: #8cc4ff;">IntOrStringOrBool</span> <span style="color: #fcaf3e;">=</span> <span style="color: #8cc4ff;">Either</span> <span style="color: #8cc4ff;">Int</span> (<span style="color: #8cc4ff;">Either</span> <span style="color: #8cc4ff;">String</span> <span style="color: #8cc4ff;">Bool</span>)

<span style="color: #fce94f;">someInt</span> <span style="color: #fcaf3e;">::</span> <span style="color: #8cc4ff;">IntOrStringOrBool</span>
<span style="color: #fce94f;">someInt</span> <span style="color: #fcaf3e;">=</span> <span style="color: #8cc4ff;">Left</span> 42

<span style="color: #fce94f;">someString</span> <span style="color: #fcaf3e;">::</span> <span style="color: #8cc4ff;">IntOrStringOrBool</span>
<span style="color: #fce94f;">someString</span> <span style="color: #fcaf3e;">=</span> <span style="color: #8cc4ff;">Right</span> (<span style="color: #8cc4ff;">Left</span> <span style="color: #e9b96e;">"Hello!"</span>)

<span style="color: #fce94f;">someBool</span> <span style="color: #fcaf3e;">::</span> <span style="color: #8cc4ff;">IntOrStringOrBool</span>
<span style="color: #fce94f;">someBool</span> <span style="color: #fcaf3e;">=</span> <span style="color: #8cc4ff;">Right</span> (<span style="color: #8cc4ff;">Right</span> <span style="color: #8cc4ff;">True</span>)
</code></pre>
</div>

</section>
<section id="slide-sec-">
<h3 id="orgd706974">What About Three Types?</h3>
<p>
Could have also reused <code>IntOrString</code>
</p>
<div class="org-src-container">

<pre  class="src src-haskell"><code trim><span style="color: #b4fa70;">type</span> <span style="color: #8cc4ff;">IntOrStringOrBool</span> <span style="color: #fcaf3e;">=</span> <span style="color: #8cc4ff;">Either</span> <span style="color: #8cc4ff;">IntOrString</span> <span style="color: #8cc4ff;">Bool</span>

<span style="color: #fce94f;">someInt</span> <span style="color: #fcaf3e;">::</span> <span style="color: #8cc4ff;">IntOrStringOrBool</span>
<span style="color: #fce94f;">someInt</span> <span style="color: #fcaf3e;">=</span> <span style="color: #8cc4ff;">Left</span> (<span style="color: #8cc4ff;">Left</span> 42)

<span style="color: #fce94f;">someString</span> <span style="color: #fcaf3e;">::</span> <span style="color: #8cc4ff;">IntOrStringOrBool</span>
<span style="color: #fce94f;">someString</span> <span style="color: #fcaf3e;">=</span> <span style="color: #8cc4ff;">Left</span> (<span style="color: #8cc4ff;">Right</span> <span style="color: #e9b96e;">"Hello!"</span>)

<span style="color: #fce94f;">someBool</span> <span style="color: #fcaf3e;">::</span> <span style="color: #8cc4ff;">IntOrStringOrBool</span>
<span style="color: #fce94f;">someBool</span> <span style="color: #fcaf3e;">=</span> <span style="color: #8cc4ff;">Right</span> <span style="color: #8cc4ff;">True</span>

<span style="color: #fce94f;">toString</span> <span style="color: #fcaf3e;">::</span> <span style="color: #8cc4ff;">IntOrStringOrBool</span> <span style="color: #fcaf3e;">-&gt;</span> <span style="color: #8cc4ff;">String</span>
<span style="color: #fce94f;">toString</span> (<span style="color: #8cc4ff;">Left</span> (<span style="color: #8cc4ff;">Left</span> i)) <span style="color: #fcaf3e;">=</span> show i
<span style="color: #fce94f;">toString</span> (<span style="color: #8cc4ff;">Left</span> (<span style="color: #8cc4ff;">Right</span> s)) <span style="color: #fcaf3e;">=</span> s
<span style="color: #fce94f;">toString</span> (<span style="color: #8cc4ff;">Right</span> b) <span style="color: #fcaf3e;">=</span> show b
</code></pre>
</div>

</section>
<section id="slide-sec-">
<h3 id="orgb2a2c92">A Better Way</h3>
<p>
But most languages that support sum types make this much easier.
</p>
<div class="org-src-container">

<pre  class="fragment (appear)"><code trim><span style="color: #b4fa70;">data</span> <span style="color: #8cc4ff;">IntOrStringOrBool</span> <span style="color: #fcaf3e;">=</span> <span style="color: #8cc4ff;">I</span> <span style="color: #8cc4ff;">Int</span>
                       <span style="color: #fcaf3e;">|</span> <span style="color: #8cc4ff;">S</span> <span style="color: #8cc4ff;">String</span>
                       <span style="color: #fcaf3e;">|</span> <span style="color: #8cc4ff;">B</span> <span style="color: #8cc4ff;">Bool</span>
</code></pre>
</div>
<div class="fragment (appear) group">
<p>
And then <code>toString</code> becomes:
</p>
<div class="org-src-container">

<pre  class="src src-haskell"><code trim><span style="color: #fce94f;">toString</span> <span style="color: #fcaf3e;">::</span> <span style="color: #8cc4ff;">IntOrStringOrBool</span> <span style="color: #fcaf3e;">-&gt;</span> <span style="color: #8cc4ff;">String</span>
<span style="color: #fce94f;">toString</span> (<span style="color: #8cc4ff;">I</span> i) <span style="color: #fcaf3e;">=</span> show i
<span style="color: #fce94f;">toString</span> (<span style="color: #8cc4ff;">S</span> s) <span style="color: #fcaf3e;">=</span> s
<span style="color: #fce94f;">toString</span> (<span style="color: #8cc4ff;">B</span> b) <span style="color: #fcaf3e;">=</span> show b
</code></pre>
</div>

</div>

</section>
<section id="slide-sec-">
<h3 id="orgdcaedd5">Constructors Don't Need to Accept Values</h3>
<div class="org-src-container">

<pre  class="src src-haskell"><code trim><span style="color: #b4fa70;">data</span> <span style="color: #8cc4ff;">RGBColor</span> <span style="color: #fcaf3e;">=</span> <span style="color: #8cc4ff;">Red</span>
              <span style="color: #fcaf3e;">|</span> <span style="color: #8cc4ff;">Green</span>
              <span style="color: #fcaf3e;">|</span> <span style="color: #8cc4ff;">Blue</span>
</code></pre>
</div>

</section>
<section id="slide-sec-">
<h3 id="org1002403">How Many Members?</h3>
<div class="org-src-container">

<pre  class="fragment (appear)"><code trim><span style="color: #b4fa70;">data</span> <span style="color: #8cc4ff;">RGBColor</span> <span style="color: #fcaf3e;">=</span> <span style="color: #8cc4ff;">Red</span> <span style="color: #fcaf3e;">|</span> <span style="color: #8cc4ff;">Green</span> <span style="color: #fcaf3e;">|</span> <span style="color: #8cc4ff;">Blue</span>
<span style="color: #73d216;">-- </span><span style="color: #73d216;">{Red, Green, Blue}</span>
</code></pre>
</div>

<div class="org-src-container">

<pre  class="fragment (appear)"><code trim><span style="color: #b4fa70;">data</span> <span style="color: #8cc4ff;">RGBColorOrBool</span> <span style="color: #fcaf3e;">=</span> <span style="color: #8cc4ff;">RGB</span> <span style="color: #8cc4ff;">RGBColor</span>
                    <span style="color: #fcaf3e;">|</span> <span style="color: #8cc4ff;">B</span> <span style="color: #8cc4ff;">Bool</span>
<span style="color: #73d216;">-- </span><span style="color: #73d216;">{RGB Red, RGB Green, RGB Blue, B True, B False}</span>
</code></pre>
</div>

<div class="org-src-container">

<pre  class="fragment (appear)"><code trim><span style="color: #b4fa70;">data</span> <span style="color: #8cc4ff;">Int16OrRGBColorOrBool</span> <span style="color: #fcaf3e;">=</span> <span style="color: #8cc4ff;">I</span> <span style="color: #8cc4ff;">Int16</span> <span style="color: #fcaf3e;">|</span> <span style="color: #8cc4ff;">RGBColor</span> <span style="color: #fcaf3e;">|</span> <span style="color: #8cc4ff;">B</span> <span style="color: #8cc4ff;">Bool</span>
<span style="color: #73d216;">-- </span><span style="color: #73d216;">65,536 + 5 = 65,541</span>
</code></pre>
</div>

<p class="fragment (appear)">
The total number of members is the <i>sum</i> of the members from each constructor.
</p>

</section>
<section id="slide-sec-">
<h3 id="org48e4268">The Constructors <i>Tag</i> the Values</h3>
<p>
Why can't we do this?
</p>
<div class="org-src-container">

<pre  class="src src-haskell"><code trim><span style="color: #b4fa70;">type</span> <span style="color: #8cc4ff;">RGBColorOrBool</span> <span style="color: #fcaf3e;">=</span> <span style="color: #8cc4ff;">RGBColor</span>
                    <span style="color: #fcaf3e;">|</span> <span style="color: #8cc4ff;">Bool</span>
</code></pre>
</div>

<p>
Instead of this?
</p>
<div class="org-src-container">

<pre  class="src src-haskell"><code trim><span style="color: #b4fa70;">data</span> <span style="color: #8cc4ff;">RGBColorOrBool</span> <span style="color: #fcaf3e;">=</span> <span style="color: #8cc4ff;">RGB</span> <span style="color: #8cc4ff;">RGBColor</span>
                    <span style="color: #fcaf3e;">|</span> <span style="color: #8cc4ff;">B</span> <span style="color: #8cc4ff;">Bool</span>
</code></pre>
</div>

</section>
<section id="slide-sec-">
<h3 id="org28e7c11">The Constructors <i>Tag</i> the Values (Continued)</h3>
<div class="group">
<p>
Because of situations like this:
</p>
<div class="org-src-container">

<pre  class="src src-haskell"><code trim><span style="color: #b4fa70;">data</span> <span style="color: #8cc4ff;">TurnDirection</span> <span style="color: #fcaf3e;">=</span> <span style="color: #8cc4ff;">Left</span> <span style="color: #fcaf3e;">|</span> <span style="color: #8cc4ff;">Right</span>
<span style="color: #b4fa70;">data</span> <span style="color: #8cc4ff;">MoralDirection</span> <span style="color: #fcaf3e;">=</span> <span style="color: #8cc4ff;">Right</span> <span style="color: #fcaf3e;">|</span> <span style="color: #8cc4ff;">Wrong</span>
<span style="color: #b4fa70;">type</span> <span style="color: #8cc4ff;">Direction</span> <span style="color: #fcaf3e;">=</span> <span style="color: #8cc4ff;">TurnDirection</span> <span style="color: #fcaf3e;">|</span> <span style="color: #8cc4ff;">MoralDirection</span> <span style="color: #73d216;">-- </span><span style="color: #73d216;">invalid Haskell</span>
</code></pre>
</div>

</div>

<div class="org-src-container">

<pre  class="fragment (appear)"><code trim><span style="color: #fce94f;">isMoral</span> <span style="color: #fcaf3e;">::</span> <span style="color: #8cc4ff;">Direction</span> <span style="color: #fcaf3e;">-&gt;</span> <span style="color: #8cc4ff;">Bool</span>
<span style="color: #fce94f;">isMoral</span> <span style="color: #8cc4ff;">Right</span> <span style="color: #fcaf3e;">=</span> <span style="color: #8cc4ff;">True</span>
<span style="color: #fce94f;">isMoral</span> <span style="color: #b4fa70;">_</span> <span style="color: #fcaf3e;">=</span> <span style="color: #8cc4ff;">False</span>
</code></pre>
</div>

<p class="fragment (appear)">
What <code>Right</code> did we get?
</p>

</section>
</section>
<section>
<section id="slide-sec-">
<h2 id="org6155b2e">Product Type</h2>
<div class="outline-text-2" id="text-org6155b2e">
</div>
</section>
<section id="slide-sec-">
<h3 id="orga9a7ebd">You've Probably Used Them Before</h3>
<ul>
<li class="fragment appear">pair</li>
<li class="fragment appear">tuple</li>
<li class="fragment appear">record</li>
<li class="fragment appear">struct</li>
<li class="fragment appear">class</li>

</ul>

</section>
<section id="slide-sec-">
<h3 id="orgd0d3521">Pairs and Tuples</h3>
<p>
Tuples are like lists of values with two important exceptions:
</p>
<ul>
<li class="fragment appear">They are heterogenous, i.e., each position can have a different type.</li>
<li class="fragment appear">Their size is fixed, i.e., you cannot add an element.</li>

</ul>

<p class="fragment (appear)">
A pair is simply a two-element tuple.
</p>

</section>
<section id="slide-sec-">
<h3 id="org6e41dc3">Tuple Examples</h3>
<div class="org-src-container">

<pre  class="fragment (appear)"><code trim><span style="color: #b4fa70;">type</span> <span style="color: #8cc4ff;">Point</span> <span style="color: #fcaf3e;">=</span> (<span style="color: #8cc4ff;">Double</span>, <span style="color: #8cc4ff;">Double</span>) <span style="color: #73d216;">-- </span><span style="color: #73d216;">(x, y)</span>
</code></pre>
</div>

<div class="org-src-container">

<pre  class="fragment (appear)"><code trim><span style="color: #b4fa70;">type</span> <span style="color: #8cc4ff;">Person</span> <span style="color: #fcaf3e;">=</span> (<span style="color: #8cc4ff;">String</span>, <span style="color: #8cc4ff;">String</span>, <span style="color: #8cc4ff;">Int</span>)
<span style="color: #73d216;">-- </span><span style="color: #73d216;">(First name, last name, age)</span>
</code></pre>
</div>

<div class="org-src-container">

<pre  class="fragment (appear)"><code trim><span style="color: #b4fa70;">type</span> <span style="color: #8cc4ff;">Score</span> <span style="color: #fcaf3e;">=</span> <span style="color: #8cc4ff;">Int</span>
<span style="color: #b4fa70;">type</span> <span style="color: #8cc4ff;">Player</span> <span style="color: #fcaf3e;">=</span> (<span style="color: #8cc4ff;">Person</span>, <span style="color: #8cc4ff;">Score</span>)
</code></pre>
</div>

</section>
</section>
<section>
<section id="slide-sec-">
<h2 id="orga06895a">More About Unions</h2>
<p>
tagged, untagged, discriminated, disjoint
</p>
</section>
</section>
</div>
</div>
<script src="https://cdn.jsdelivr.net/npm/reveal.js@3.8.0/js/reveal.js"></script>

<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({

controls: true,
progress: true,
history: false,
center: true,
slideNumber: 'c',
rollingLinks: false,
keyboard: true,
overview: true,

theme: Reveal.getQueryHash().theme, // available themes are in /css/theme
transition: Reveal.getQueryHash().transition || 'default', // default/cube/page/concave/zoom/linear/fade/none
transitionSpeed: 'default',
multiplex: {
    secret: '', // null if client
    id: '', // id, obtained from socket.io server
    url: '' // Location of socket.io server
},

// Optional libraries used to extend on reveal.js
dependencies: [
 { src: 'https://cdn.jsdelivr.net/npm/reveal.js@3.8.0/lib/js/classList.js', condition: function() { return !document.body.classList; } },
 { src: 'https://cdn.jsdelivr.net/npm/reveal.js@3.8.0/plugin/markdown/marked.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'https://cdn.jsdelivr.net/npm/reveal.js@3.8.0/plugin/markdown/markdown.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'https://cdn.jsdelivr.net/npm/reveal.js@3.8.0/plugin/zoom-js/zoom.js', async: true, condition: function() { return !!document.body.classList; } },
 { src: 'https://cdn.jsdelivr.net/npm/reveal.js@3.8.0/plugin/notes/notes.js', async: true, condition: function() { return !!document.body.classList; } }]
});
</script>
</body>
</html>
